In [2]:
import pandas as pd
obj = pd.Series([3,5,6,7,8,-3,-6])

In [3]:
obj

0    3
1    5
2    6
3    7
4    8
5   -3
6   -6
dtype: int64

In [7]:
obj.values

array([ 3,  5,  6,  7,  8, -3, -6])

In [8]:
obj.index

RangeIndex(start=0, stop=7, step=1)

In [11]:
obj2 = pd.Series([4,6,7,8], index=['a','b','c','d'])

In [12]:
obj2.values

array([4, 6, 7, 8])

In [13]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [14]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 =pd.Series(sdata)

In [15]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [16]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [17]:
obj4 = pd.Series(sdata,index =states)

In [18]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [20]:
import numpy as  np

In [24]:
index= pd.Index(np.arange(3))
index

Int64Index([0, 1, 2], dtype='int64')

In [26]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [27]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [28]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [29]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [30]:
obj3 = obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

In [31]:
obj3

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [32]:
 obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
 obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [34]:
#dropping c
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [35]:
#With DataFrame, index values can be deleted from either axis:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
index=['Ohio', 'Colorado', 'Utah', 'New York'],
 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [39]:
new_data = data.drop('Ohio')
new_data

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [38]:
drop_col = data.drop('two', axis =1)
drop_col

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [40]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [41]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [42]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [44]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [45]:
obj[['a','d']]

a    0.0
d    3.0
dtype: float64

In [46]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])

In [47]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [48]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [49]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [50]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [51]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
 index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [52]:
frame

               b         d         e
Utah   -0.069560  1.950603  0.349890
Ohio    0.666155  0.482379 -0.581957
Texas   0.794755  1.386061  0.543637
Oregon  1.333913  0.730378  2.093826

In [53]:
np.abs(frame)

               b         d         e
Utah    0.069560  1.950603  0.349890
Ohio    0.666155  0.482379  0.581957
Texas   0.794755  1.386061  0.543637
Oregon  1.333913  0.730378  2.093826

In [55]:
f = lambda x : x.max() -x.min()

In [56]:
frame.apply(f)

b    1.403473
d    1.468225
e    2.675784
dtype: float64

In [57]:
 1.403473+0.349890

1.753363

In [58]:
1.950603-0.069560

1.881043

In [59]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [60]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [61]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [63]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
columns=['d', 'a', 'b', 'c'])

In [64]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [67]:
 df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
 [np.nan, np.nan], [0.75, -1.3]],
 index=['a', 'b', 'c', 'd'],
 columns=['one', 'two'])

In [71]:
df = pd.read_csv('/Users/bibhu/Documents/DataAnalysis/data/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12      foo

In [72]:
df1 = pd.read_table('/Users/bibhu/Documents/DataAnalysis/data/ex1.csv',sep=',')
df1

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12      foo

In [73]:
df2 = pd.read_csv('/Users/bibhu/Documents/DataAnalysis/data/ex1.csv',header =None)
df2

   0   1   2   3         4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12       foo

In [74]:
#if no header and you read it with out specifying anything it will
#treat the first row as header
df3 = pd.read_table('/Users/bibhu/Documents/DataAnalysis/data/ex2.csv',sep=',')
df3

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12     foo

In [76]:
 #you can specify the header as below while reading the file
    df4 = pd.read_csv('/Users/bibhu/Documents/DataAnalysis/data/ex2.csv', names=['a', 'b', 'c', 'd', 'message'])
 df4

   a   b   c   d message
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12     foo

In [77]:
names = ['a', 'b', 'c', 'd', 'message']

In [78]:
df5 = pd.read_csv('/Users/bibhu/Documents/DataAnalysis/data/ex2.csv', names = names, index_col = 'message')
df5

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [79]:
#with out specifying the index_col
#it will create default index col
df6 = pd.read_csv('/Users/bibhu/Documents/DataAnalysis/data/ex2.csv', names = names)
df6

   a   b   c   d message
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12     foo

In [81]:
#specifying index col here creates multiple index
parsed = pd.read_csv('/Users/bibhu/Documents/DataAnalysis/data/csv_mindex.csv', index_col=['key1', 'key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [82]:
# with specifying index col 
#creates a default index 
parsed1 = pd.read_csv('/Users/bibhu/Documents/DataAnalysis/data/csv_mindex.csv')
parsed1

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

In [83]:
result = pd.read_table('/Users/bibhu/Documents/DataAnalysis/data/ex3.txt',sep ='\s+')
result

     ['         A         B          C\n',
0  'aaa -0.264438 -1.026059  -0.619500\n',
1  'bbb  0.927272  0.302904  -0.032399\n',
2  'ccc -0.264273 -0.386314  -0.217601\n',
3  'ddd -0.871858 -0.348382   1.100491\n']

In [85]:
df6 = pd.read_csv('/Users/bibhu/Documents/DataAnalysis/data/ex4.csv', skiprows=[0,2,3])
df6

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [86]:
#withou t skip rows
df7 = pd.read_csv('/Users/bibhu/Documents/DataAnalysis/data/ex4.csv')
df7

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

In [87]:
df8 = pd.read_csv('/Users/bibhu/Documents/DataAnalysis/data/ex5.csv')
df8

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [88]:
#to check nulls
pd.isnull(df8)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [91]:
result1 = pd.read_csv('/Users/bibhu/Documents/DataAnalysis/data/ex5.csv', na_values=['NULL'])
result1

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [92]:
limdf = pd.read_csv('/Users/bibhu/Documents/DataAnalysis/data/weather_2012.csv', nrows=5)
limdf

,Date/Time,Temp (C),Dew Point Temp (C),Rel Hum (%),Wind Spd (km/h),Visibility (km),Stn Press (kPa),Weather
0,2012-01-01 00:00:00,-1.8,-3.9,86,4,8.0,101.24,Fog
1,2012-01-01 01:00:00,-1.8,-3.7,87,4,8.0,101.24,Fog
2,2012-01-01 02:00:00,-1.8,-3.4,89,7,4.0,101.26,"Freezing Drizzle,Fog"
3,2012-01-01 03:00:00,-1.5,-3.2,88,6,4.0,101.27,"Freezing Drizzle,Fog"
4,2012-01-01 04:00:00,-1.5,-3.3,88,7,4.8,101.23,Fog

In [93]:
df9 = pd.read_csv('/Users/bibhu/Documents/DataAnalysis/data/weather_2012.csv')
df9

,Date/Time,Temp (C),Dew Point Temp (C),Rel Hum (%),Wind Spd (km/h),Visibility (km),Stn Press (kPa),Weather
0,2012-01-01 00:00:00,-1.8,-3.9,86,4,8.0,101.24,Fog
1,2012-01-01 01:00:00,-1.8,-3.7,87,4,8.0,101.24,Fog
2,2012-01-01 02:00:00,-1.8,-3.4,89,7,4.0,101.26,"Freezing Drizzle,Fog"
3,2012-01-01 03:00:00,-1.5,-3.2,88,6,4.0,101.27,"Freezing Drizzle,Fog"
4,2012-01-01 04:00:00,-1.5,-3.3,88,7,4.8,101.23,Fog
...,...,...,...,...,...,...,...,...
8779,2012-12-31 19:00:00,0.1,-2.7,81,30,9.7,100.13,Snow
8780,2012-12-31 20:00:00,0.2,-2.4,83,24,9.7,100.03,Snow
8781,2012-12-31 21:00:00,-0.5,-1.5,93,28,4.8,99.95,Snow
8782,2012-12-31 22:00:00,-0.2,-1.8,89,28,9.7,99.91,Snow
8783,2012-12-31 23:00:00,0.0,-2.1,86,30,11.3,99.89,Snow

In [94]:
#To read out a file in pieces, specify a chunksize as a number of rows:
chunker = pd.read_csv('/Users/bibhu/Documents/DataAnalysis/data/weather_2012.csv', chunksize=100)
chunker

In [97]:
chunker = pd.read_csv('/Users/bibhu/Documents/DataAnalysis/data/weather_2012.csv', chunksize=100)
chunker
tot = pd.Series([])
for piece in chunker:
 tot = tot.add(piece['key'].value_counts(), fill_value=0)
tot = tot.order(ascending=False)

In [98]:
limdf.to_csv('/Users/bibhu/Documents/DataAnalysis/data/op1.csv')

In [100]:
limdf.to_csv(sys.stdout, sep='|')

NameError: name 'sys' is not defined

In [101]:
#Series also has a to_csv method:
dates = pd.date_range('1/1/2000', periods=7)
ts = pd.Series(np.arange(7), index=dates)
ts.to_csv('/Users/bibhu/Documents/DataAnalysis/data/tseries.csv')

In [104]:
#to read data from pickle
frame = pd.read_csv('/Users/bibhu/Documents/DataAnalysis/data/op1.csv')
frame
frame.save('/Users/bibhu/Documents/DataAnalysis/data/frame_pickle')

AttributeError: 'DataFrame' object has no attribute 'save'

In [ ]:
#read excel
xls_file = pd.ExcelFile('data.xls')